# Access

In [1]:
import pandas as pd
import numpy as np
import sqlite3
import seaborn as sns
import matplotlib as mpl
import matplotlib.pyplot as plt
import warnings
import datetime
import matplotlib.dates as mdates

from scipy import stats
from matplotlib.dates import DateFormatter
from IPython.display import display

# Load and Display Raw Data

In [2]:
db_survey = sqlite3.connect(
    "C:\\Users\\Space\\Documents\\py\\Projects\\TuringCollege\\TechMentalHealth\\DataSet\\mental_health.sqlite"
)

In [3]:
%matplotlib inline
pd.options.display.max_rows = 300000
pd.options.display.max_columns = 999
pd.options.display.max_colwidth = 500

# Colors

In [4]:
ord_color = "bisque"
spec_lev1 = "crimson"
spec_lev2 = "orangered"
spec_lev3 = "lightcoral"
male_color = "royalblue"
female_color = "pink"
graph_color1 = "indianred"
graph_color2 = "slategrey"

# Answers

In [5]:
df_answers = pd.read_sql_query("SELECT * FROM Answer", db_survey)
df_answers.head()

  AnswerText  SurveyID  UserID  QuestionID
0         37      2014       1           1
1         44      2014       2           1
2         32      2014       3           1
3         31      2014       4           1
4         31      2014       5           1

# Tech Workers in Tech Companies

In [6]:
df_Answer9 = pd.read_sql_query(
    "SELECT USERID FROM Answer where QuestionID = 9 AND AnswerText = '1'",
    db_survey
)

In [7]:
df_Answer9.count()

UserID    2888
dtype: int64

In [8]:
df_Answer13 = pd.read_sql_query(
    "SELECT USERID FROM Answer where QuestionID = 13 AND AnswerText = '1'",
    db_survey
)

In [9]:
df_Answer13.count()

UserID    1471
dtype: int64

In [10]:
df_TechinTech = pd.merge(df_Answer13, df_Answer9 , on='UserID', how='inner')

In [11]:
Total_TechinTech = df_TechinTech.count()
Total_TechinTech

UserID    909
dtype: int64

# 14 
Do you know options for mental health care available under your employer provided health coverage?

In [12]:
df_Answer14 = pd.read_sql_query(
    "SELECT * FROM Answer where QuestionID = 14",
    db_survey
)
df_Answer14.head()

  AnswerText  SurveyID  UserID  QuestionID
0         -1      2016    1261          14
1        Yes      2016    1262          14
2         -1      2016    1263          14
3         -1      2016    1264          14
4        Yes      2016    1265          14

In [13]:
df_Answer14.count()

AnswerText    2958
SurveyID      2958
UserID        2958
QuestionID    2958
dtype: int64

In [14]:
df_Answer14_Distinct = pd.read_sql_query(
    "SELECT DISTINCT AnswerText FROM Answer where QuestionID = 14",
    db_survey
)
df_Answer14_Distinct

      AnswerText
0             -1
1            Yes
2  I am not sure
3             No

In [15]:
df_Answer14_Yes = pd.read_sql_query(
    "SELECT UserID FROM Answer where QuestionID = 14 AND AnswerText = 'Yes'",
    db_survey
)
df_Answer14_Yes.count()

UserID    869
dtype: int64

In [16]:
df_Answer14TechinTech = pd.merge(df_TechinTech, df_Answer14_Yes, on='UserID', how='inner')

In [18]:
df_Answer14TechinTech.count()

UserID    378
dtype: int64

In [19]:
df_Answer14TechinTech.head()

   UserID
0    2694
1    2695
2    2697
3    2700
4    2724

# 94 
Do you know options for mental health care your employer provides?

In [154]:
df_Answer94 = pd.read_sql_query(
    "SELECT * FROM Answer where QuestionID = 94",
    db_survey
)
df_Answer94.head()

  AnswerText  SurveyID  UserID  QuestionID
0   Not sure      2014       1          94
1         No      2014       2          94
2         No      2014       3          94
3        Yes      2014       4          94
4         No      2014       5          94

In [155]:
df_Answer94.count()

AnswerText    1260
SurveyID      1260
UserID        1260
QuestionID    1260
dtype: int64

In [156]:
df_Answer94_Distinct = pd.read_sql_query(
    "SELECT DISTINCT AnswerText FROM Answer where QuestionID = 94",
    db_survey
)
df_Answer94_Distinct

  AnswerText
0   Not sure
1         No
2        Yes

In [180]:
df_Answer94_Yes = pd.read_sql_query(
    "SELECT UserID FROM Answer where QuestionID = 94 AND AnswerText = 'Not sure'",
    db_survey
)
df_Answer94_Yes.count()

UserID    314
dtype: int64

In [181]:
df_Answer94TechinTech = pd.merge(df_TechinTech, df_Answer94_Yes , on='UserID', how='inner')

In [182]:
df_Answer94TechinTech.count()

UserID    0
dtype: int64

# 10 
Does employer provide mental health benefits as part of healthcare coverage?

In [138]:
df_Answer10 = pd.read_sql_query(
    "SELECT * FROM Answer where QuestionID = 10",
    db_survey
)
df_Answer10.head()

   AnswerText  SurveyID  UserID  QuestionID
0         Yes      2014       1          10
1  Don't know      2014       2          10
2          No      2014       3          10
3          No      2014       4          10
4         Yes      2014       5          10

In [139]:
df_Answer10.count()

AnswerText    4218
SurveyID      4218
UserID        4218
QuestionID    4218
dtype: int64

In [140]:
df_Answer10_Distinct = pd.read_sql_query(
    "SELECT DISTINCT AnswerText FROM Answer where QuestionID = 10",
    db_survey
)
df_Answer10_Distinct

                       AnswerText
0                             Yes
1                      Don't know
2                              No
3  Not eligible for coverage / NA
4                              -1
5                    I don't know

In [141]:
df_Answer10_Yes = pd.read_sql_query(
    "SELECT UserID FROM Answer where QuestionID = 10 AND AnswerText = 'Yes'",
    db_survey
)
df_Answer10_Yes.count()

UserID    1744
dtype: int64

In [142]:
df_Answer10TechinTech = pd.merge(df_TechinTech, df_Answer10_Yes , on='UserID', how='inner')

   UserID
0    2695
1    2697
2    2700
3    2701
4    2724

In [144]:
df_Answer10TechinTech.count()

UserID    498
dtype: int64

In [ ]:
df_Answer10TechinTech.head()

# 16 
Does employer offer resources to learn more about mental health disorders and options for seeking help?

In [183]:
df_Answer16 = pd.read_sql_query(
    "SELECT * FROM Answer where QuestionID = 16",
    db_survey
)
df_Answer16.head()

  AnswerText  SurveyID  UserID  QuestionID
0         No      2016    1261          16
1        Yes      2016    1262          16
2         No      2016    1263          16
3         -1      2016    1264          16
4         No      2016    1265          16

In [184]:
df_Answer16.count()

AnswerText    2958
SurveyID      2958
UserID        2958
QuestionID    2958
dtype: int64

In [185]:
df_Answer16_Distinct = pd.read_sql_query(
    "SELECT DISTINCT AnswerText FROM Answer where QuestionID = 16",
    db_survey
)
df_Answer16_Distinct

     AnswerText
0            No
1           Yes
2            -1
3  I don't know

In [186]:
df_Answer16_Yes = pd.read_sql_query(
    "SELECT UserID FROM Answer where QuestionID = 16 AND AnswerText = 'Yes'",
    db_survey
)
df_Answer16_Yes.count()

UserID    702
dtype: int64

In [187]:
df_Answer16TechinTech = pd.merge(df_TechinTech, df_Answer16_Yes , on='UserID', how='inner')

   UserID
0    2737
1    2748
2    2752
3    2754
4    2781

In [188]:
df_Answer16TechinTech.count()

UserID    255
dtype: int64

In [ ]:
df_Answer16TechinTech.head()

# 96 
Does your employer provide resources to learn more about mental health issues and how to seek help?

In [189]:
df_Answer96 = pd.read_sql_query(
    "SELECT * FROM Answer where QuestionID = 96",
    db_survey
)
df_Answer96.head()

   AnswerText  SurveyID  UserID  QuestionID
0         Yes      2014       1          96
1  Don't know      2014       2          96
2          No      2014       3          96
3          No      2014       4          96
4  Don't know      2014       5          96

In [190]:
df_Answer96.count()

AnswerText    1260
SurveyID      1260
UserID        1260
QuestionID    1260
dtype: int64

In [191]:
df_Answer96_Distinct = pd.read_sql_query(
    "SELECT DISTINCT AnswerText FROM Answer where QuestionID = 96",
    db_survey
)
df_Answer96_Distinct

   AnswerText
0         Yes
1  Don't know
2          No

In [205]:
df_Answer96_Yes = pd.read_sql_query(
    "SELECT UserID FROM Answer where QuestionID = 96 AND AnswerText = 'Don''t know'",
    db_survey
)
df_Answer96_Yes.count()

UserID    363
dtype: int64

In [206]:
df_Answer96TechinTech = pd.merge(df_TechinTech, df_Answer96_Yes , on='UserID', how='inner')

In [207]:
df_Answer96TechinTech.count()

UserID    0
dtype: int64